events/app/views/events/_form.html.erb

			<li>
				<%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"