flix/app/views/genres/index.html.erb

<ol>
	<% Genre.all.each do |genre| %>
---
SELECT "genres".* FROM "genres"