events/app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
		@likers = @event.likers
		@categories = @event.categories

		if current_user
			@current_like = current_user.likes.find_by(event_id: @event.id)
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "likes".* FROM "likes"  WHERE "likes"."user_id" = ? AND "likes"."event_id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."event_id" = ?  [["event_id", 1]]

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "Updated Event Name"], ["starts_at", "2015-07-29 12:23:00.000000"], ["updated_at", "2015-07-19 12:23:46.143484"]]

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)