events/app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-07-25 16:54:44.231854"], ["event_id", 1], ["updated_at", "2015-07-25 16:54:44.231854"], ["user_id", 1]]
---
	def create
		set_event
		@event.likes.create!(user: current_user)

SELECT  "likes".* FROM "likes"  WHERE "likes"."user_id" = ? AND "likes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
	def destroy
		like = current_user.likes.find(params[:id])
		like.destroy

SELECT  "events".* FROM "events"  WHERE "events"."slug" = 'bugsmash' LIMIT 1
---
	def set_event
		@event = Event.find_by(slug: params[:event_id])