events/app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("created_at", "email", "event_id", "how_heard", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-07-19 12:23:45.757922"], ["email", "joe@gmail.com"], ["event_id", 1], ["how_heard", "Twitter"], ["name", "Joe Developer"], ["updated_at", "2015-07-19 12:23:45.757922"]]
---
  def create
    @registration = @event.registrations.new(registration_params)
		@registration.user = current_user
    if @registration.save