flix/app/controllers/favorites_controller.rb

	def destroy
		favorite = current_user.favorites.find(params[:id])
		favorite.destroy
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 5], ["id", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]