flix/app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
		@review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Awesomesauce!"], ["created_at", "2015-07-25 13:52:40.421709"], ["movie_id", 1], ["stars", 4], ["updated_at", "2015-07-25 13:52:40.421709"], ["user_id", 5]]